server/artillery/result/PromiseAll_or_ForOf/나의커뮤니티20초1명NGINX_Promise/api_test.yaml
config:
  target : 'http://49.50.167.202:5001'
  phases:
    - duration: 20
      arrivalRate: 1
      name: Warm up
#    - duration: 120
#      arrivalRate: 5
#      rampTo: 50
#      name: Ramp up load
#    - duration: 600
#      arrivalRate: 50
#      name: Sustained load

before:
  flow:
    - post:
        url : '/api/user/auth/signin'
        json:
          id: 'kny@gmail.com'
          password: '12341234'
        capture:
          json: '$.result.accessToken'
          as: accessToken
        expect:
          - statusCode: 201
scenarios:
  - flow:
#      - get:
#          url: '/api/users?search=t'
#        headers:
#          authorization: 'Bearer {{accessToken}}'
#      - get:
#          url: '/api/user/followings'
#          headers:
#            authorization: 'Bearer {{accessToken}}'
#      - think : 1
      - get:
          url: '/api/communities'
          headers:
            authorization: 'Bearer {{accessToken}}'
#      - think : 1
#      - get:
#          url: '/api/communities/63956c42d1a615bf564e3af6/users'
#          headers:
#            authorization: 'Bearer {{accessToken}}'